[M_Ep6_RescueRoland MissionDefinition]
MissionDescription="Roland, the main character in the fight against Hyperion and the handsome Jack, has been kidnapped by bloodthirsty pirates.. This is bad. Lilith tells you to go to Castle Bloodshot [location] and destroy Roland.. Easy!"
TurnInDescription="You saved Roland from Hyperion; this means, "Thanks for saving me from the bad guys; Now let's talk about what to do with Jack."]."

[M_Ep6_RescueRoland:CollectCarPartsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the true leader of the opposition Hyperion and handsome Jack, will be removed from the blood group.. This is bad. This is a bug caused by moving vehicles [space] Shat [-space] Blood cannot enter.. Bloodsuckers will never let you in until your car is covered in blood, guts and other pirate stuff.. Eli has a simple plan. If you pick up parts to hide in the battle area, he will teach you the ways of thieves. And you can go into the pool to save Roland.."

[M_Ep6_RescueRoland:ConstructorChasePreludeSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Bloodthirsty bandits kidnap Roland, the leader of the opposition against Hyperion, and handsome Jack.. It's not good.. [Location] Masu Palace[-Location] Attacked by Hyperion's army, the Blood Warriors were killed rather than pay a ransom.. This is the worst.. Lilith tells Hyperion to find Roland and bring him back before pulling him out of the pool.."

[M_Ep6_RescueRoland:EnterDamSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the true leader of the resistance against Hyperon and Handsome Jack, is kidnapped by the Bloodshot pirate family.. It is wrong. Your mission is simple find Roland and destroy him."

[M_Ep6_RescueRoland:FendOffLastWave MissionObjectiveDefinition]
ProgressMessage="Remove the download."

[M_Ep6_RescueRoland:GetToThePrisonBot MissionObjectiveDefinition]
ProgressMessage="Open W4R-D3N"

[M_Ep6_RescueRoland:GetToThePrisonBotSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the true leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot Bandits.. this is not good. [Location] Bloodshot's base [-Location] is attacked by Hyperion's forces, who choose to kill Bloodshot rather than save him.. this is not good. Roland HP now brings the Hyperion construction robot to Pewsey. Lilith tells Roland to destroy the robot before throwing it into the dirt behind the bridge.."

[M_Ep6_RescueRoland:KillPrisonBotOnDamTopSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the true leader of the resistance against Hyperion and Handsome Jack, has been kidnapped by the Bloodshot Bandits.. this is not good. [Location] Bloodshot's base [-Location] is attacked by Hyperion's forces, who choose to kill Bloodshot rather than save him.. this is not good. Roland HP now brings the Hyperion construction robot to Pewsey. Lilith tells Roland to destroy the robot before throwing it into the dirt behind the bridge.."

[M_Ep6_RescueRoland:KissMyAssMomentSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Roland, the true leader of the opposition against Hyperion and handsome Jack, is kidnapped by Bloodshot's gang.. He is evil. Anyway, thanks to Ellie, you now have a car to make the gang think you're one of them.. Go to [Location] Bloodshot Stronghold [-Location] and enter the new squad car.."

[M_Ep6_RescueRoland:ReturnToScootieSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Take part in a real fight with Roland, Hyperion and Handsome Jack kidnapped by the Bloodshot gang.. This is not true. Another bad thing? In fact, Bloodshot Fortress [location] is currently not accessible by car.. Blood shooters won't believe you're one of them unless your car is covered in blood, guts, and other nasty stuff.. Scout sister Ellie has a simple plan. If you collect stolen car parts from [Prism] dust, this will give you the thief skill.. You can use the new demolition machine in the pool to save Roland.. We took the pieces and took them to Eli.. Simply upload your new activity to the Catch-A-Ride library.."

[M_Ep6_RescueRoland:TalkToEllieSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="A family of robbers kidnap Roland Bloodshot, the true leader of Hyperon and Handsome Jack.. That's wrong. Is something bad happening? Blood Control [Location] is not currently accessible on your system.. Bloodshot won't trust you unless your character is covered in blood, gore, and other fakes.. So Scooter said he decided to meet his sister Ellie at the scene.]. Your vehicle may be damaged.."

[M_Ep6_RescueRoland:TalkToEllieTitleCardSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="A family of robbers kidnap Roland Bloodshot, the true leader of Hyperon and Handsome Jack.. That's wrong. Is something bad happening? Blood Control [Location] is not currently accessible on your system.. Bloodshot won't trust you unless your character is covered in blood, gore, and other fakes.. So Scooter said he decided to meet his sister Ellie at the scene.]. Your vehicle may be damaged.."
